## BHMS3323 Practices of FinTech

## Lab4 - Pandas

The `pandas` package is one of the most important tools for data scientists working on Python. 

We can use `pandas` to explore data in a dataset in *table* format. In `pandas`, it uses DataFrame to describe tabular data. 

You have to download and import the package in your Python environment to use' pandas'. In Colab, you can directly import the package using the codes below.

In [1]:
import pandas as pd  #import the pandas package and give an alias as 'pd'

Pandas has two primary components: `Series` and `DataFrame`.

A Series is similar to a list, but `series` is a list with an index.

In [2]:
# x is a list

x = ['a','b', 'c']
y = pd.Series(['a' ,'b','c'])

In [3]:
print(x)

['a', 'b', 'c']

In [4]:
print(y)

0    a
1    b
2    c
dtype: object

If you do not specify an index to a series, it will automatically assign a numeric index.

You can access the 2nd item of a list or series by specifying an index of 1.

E.g. `x[1]` and `y[1]`

In [5]:
print(x[1])

b

In [6]:
print(y[1])

b

What makes `series` different from `list` is you can refer to an item in a `series` by self-defining an index label.

We can define a series `score` to represent Team A, B, and C scores in the following way.

In [7]:
# y is a series with index ["Team A", "Team B", "Team C"] 
score = pd.Series([56,57,62], index=["Team A", "Team B", "Team C"])

print(score)

Team A    56
Team B    57
Team C    62
dtype: int64

In [8]:
# you can get the score of Team C by either the following way:

print(score[2])

print(score["Team C"])

62
62

We can use `pandas` to represent tabular data. Suppose that we have 10 students in this Fintech class, and their marks of assignment 1 and 2 are as follow:
    
![score](images/lab04_figure1.png)

We can create a variable `student_name` to contain all our students' names.

`student_name = ['Peter', 'Joe', 'Kris', 'Amy', 'Alfred', 'Jan', 'Bill', 'Christine', 'Roy', 'Phoebe']`

Then we can create two series of `assignment1` and `assignment2` to store their marks.

`assignment1 = pd.Series([60,75,95,90,35,65,80,90,75,70], index=student_name)`

<br/>

`assignment2 = pd.Series([60,80,100,85,70,80,60,85,70,60], index=student_name)`
<br/>

In [9]:
student_name = ['Peter', 'Joe', 'Kris', 'Amy', 'Alfred', 'Jan', 'Bill', 'Christine', 'Roy', 'Phoebe']
assignment1 = pd.Series([60,75,95,90,35,65,80,90,75,70], index=student_name)
assignment2 = pd.Series([60,80,100,85,70,80,60,85,70,60], index=student_name)

In [10]:
print(assignment1)

Peter        60
Joe          75
Kris         95
Amy          90
Alfred       35
Jan          65
Bill         80
Christine    90
Roy          75
Phoebe       70
dtype: int64

In [11]:
print(assignment2)

Peter         60
Joe           80
Kris         100
Amy           85
Alfred        70
Jan           80
Bill          60
Christine     85
Roy           70
Phoebe        60
dtype: int64

In [12]:
# exercise 1
# What are the marks of Joe's assignment 1 and assignment 2.

In [13]:
# exercise 2
# What is the average marks of assignment 1? Wnat is the highest marks, lowest marks, and s.d.?

You can form a DataFrame to represent the data by combining the two series.

![dataframe](images/lab04_figure2.png)

In [14]:
# data is a Python dictionary 

data = {
    "assignment 1": assignment1,
    "assignment 2": assignment2
}

result = pd.DataFrame(data)

result

           assignment 1  assignment 2
Peter                60            60
Joe                  75            80
Kris                 95           100
Amy                  90            85
Alfred               35            70
Jan                  65            80
Bill                 80            60
Christine            90            85
Roy                  75            70
Phoebe               70            60

You can extract Kris's scores by locating the row using the 'index name'.

The code is `.loc`.

In [15]:
result.loc["Kris"]

assignment 1     95
assignment 2    100
Name: Kris, dtype: int64

OR you can locate the 3rd row by using 'index number'.

The code is `.iloc`

In [16]:
# index number starts with 0, the 3rd item has index number of 2

result.iloc[2]

assignment 1     95
assignment 2    100
Name: Kris, dtype: int64

You can append new rows for a new student by:

In [17]:
# create a series that contains raymond's marks
ray_marks = pd.Series([60,70], index=["assignment 1", "assignment 2"])

ray_marks

assignment 1    60
assignment 2    70
dtype: int64

In [18]:
# create a dataframe with the row index of "raymond"
# index has to be an array even you only include one record

ray_record = pd.DataFrame([ray_marks], index=["Raymond"])

ray_record

         assignment 1  assignment 2
Raymond            60            70

In [19]:
# concat the two Dataframes together.   
# Noted that you should pass a DataFrame array as the argument

pd.concat([result, ray_record])

           assignment 1  assignment 2
Peter                60            60
Joe                  75            80
Kris                 95           100
Amy                  90            85
Alfred               35            70
Jan                  65            80
Bill                 80            60
Christine            90            85
Roy                  75            70
Phoebe               70            60
Raymond              60            70

In [20]:
result = pd.concat([result, ray_record])
result

           assignment 1  assignment 2
Peter                60            60
Joe                  75            80
Kris                 95           100
Amy                  90            85
Alfred               35            70
Jan                  65            80
Bill                 80            60
Christine            90            85
Roy                  75            70
Phoebe               70            60
Raymond              60            70

Pandas DataFrame provides lots of functions regarding descriptive statistics. Please refer to W3School website [link](https://www.w3schools.com/python/pandas/default.asp) for details.

In [21]:
result.describe()

       assignment 1  assignment 2
count     11.000000     11.000000
mean      72.272727     74.545455
std       17.228412     12.738631
min       35.000000     60.000000
25%       62.500000     65.000000
50%       75.000000     70.000000
75%       85.000000     82.500000
max       95.000000    100.000000

You can also load data from an excel file with CSV format into a DataFrame.

In [33]:
URI = 'https://raw.githubusercontent.com/kwongwaiman/BHMS3323_FinTech_202122/main/data/lab4_marks.csv' 
marks = pd.read_csv(URI)
#marks = pd.read_csv("data/lab4_marks.csv")
marks

        Name  Assignment 1  Assignment 2  Final Exam
0      Peter            60            60          60
1        Joe            75            80          50
2       Kris            95           100          95
3        Amy            90            85          95
4     Alfred            35            70          85
5        Jan            65            80          64
6       Bill            80            60          70
7  Christine            90            85          72
8        Roy            75            70          90
9     Phoebe            70            60          80

Suppose the way to calculate the total marks of the subject is:

(assignment 1) $\times$ 30% + (assignment 2) $\times$ 30% + (final exame) $\times$ 40%

We can calculate the total marks for all students with the following codes:

In [34]:
def cal_total(hw1, hw2, exam):
    return (hw1*0.3+hw2*0.3+exam*0.4)

marks['total'] = marks.apply(lambda row: cal_total(row['Assignment 1'], row['Assignment 2'], row['Final Exam']), axis = 1)

In [24]:
marks

        Name  Assignment 1  Assignment 2  Final Exam  total
0      Peter            60            60          60   60.0
1        Joe            75            80          50   66.5
2       Kris            95           100          95   96.5
3        Amy            90            85          95   90.5
4     Alfred            35            70          85   65.5
5        Jan            65            80          64   69.1
6       Bill            80            60          70   70.0
7  Christine            90            85          72   81.3
8        Roy            75            70          90   79.5
9     Phoebe            70            60          80   71.0

Similarly, you can define a function `grade()` that we used in tutorial 1 for returning the student's grade.

In [25]:
def grade(marks):

    grade = 'F'

    if marks > 0 and marks < 40:
        grade = 'F'
    elif marks >=40 and marks < 60:
        grade = 'D'
    elif marks >=60 and marks < 70:
        grade = 'C'
    elif marks >=70 and marks < 80:
        grade = 'B'
    elif marks >=80:
        grade = 'A'

    return grade

In [26]:
# exercise
# write the line to returning the grade below

# marks['grade'] = ...